<template>
    <section class="itego-faq">
        <div class="container">
            <div class="itego-faq__title">
                Знаем, что Вас волнует
            </div>
            <ItegoFAQitem v-for="item in data" :title="item.title" :text="item.text"/>
        </div>
    </section>
</template>

<script>
import ItegoFAQitem from './ItegoFAQitem.vue'

export default {
    name: 'ItegoFAQ',
    data() {
        return {
            data: [
                {
                    title: 'В каких городах России Вы работаете?',
                    text: 'В Москве и ближайших городах Московской области'
                },
                {
                    title: 'От чего зависит цена на IT-обслуживание?',
                    text: 'От количества ПК и серверов, а также сервисов, которые мы будем поддерживать'
                },
                {
                    title: 'Как быстро реагируете на инциденты и проблемы?',
                    text: 'Первая реакция на инцидент не позже 20 минут, а чаще в течение 2-5 минут'
                },
                {
                    title: 'Как Вы обеспечите сохранность моих данных и доступа к ним?',
                    text: 'Мы используем собственную систему хранение всех паролей с шифрованием, разграничивая доступ для своих сотрудников, вы так же получаете доступ и видите все свои пароли в одном месте и всегда актуальны.'
                },
                {
                    title: 'Как происходит масштабирование услуг при необходимости расширения бизнеса?',
                    text: 'Мы всегда на связи и стараемся всячески помогать вам в этом, по этому при резком росте бизнеса вы не потеряете в качестве так-как мы следим за загруженностью сотрудников и вовремя пополняем штат или перекидываем персонал на необходимые проекты'
                },
                {
                    title: 'Сколько человек будет поддерживать нашу компанию? Или это будет выделенный специалист?',
                    text: 'Наша структура делиться на несколько линий, где есть свои регламенты и инструкции, даже если вашу заявку принял новый сотрудник он уже знает о вашей организации всё что необходимо для решения задачи. Если вам необходим Project Manager или постоянный специалист - мы предоставляем такую возможность.'
                },
                {
                    title: 'Вы работаете только удаленно?',
                    text: 'Мы используем лицензии для подключения к ПК, если удаленно проблему решить не возможно или запланированы работы в офисе, то наши специалисты выезжают к нашим клиентам без ограничения'
                },
                {
                    title: 'Вы работаете из дома или вы официальная организация?',
                    text: 'У нас есть офис в котором работают сотрудники и основная команда для быстрого решения инцидентов. Вы можете его посетить и познакомится со своей службой поддержки :).'
                },
            ]
        }
    },
    components: {
        ItegoFAQitem
    }
}
</script>

<style lang="scss">
.itego-faq {
    padding: 65px 0;
    &__title {
        font-family: "Montserrat", sans-serif;
        font-weight: 700;
        font-size: 45px;
        color: #1565C0;
        padding-bottom: 50px;
        border-bottom: 2px solid #1565C0;
    }
}
</style>

<style lang="scss">
@media screen and (max-width: 768px) {
    .itego-faq {
        &__title {
            font-size: 30px;
        }
    }
}
@media screen and (max-width: 425px) {
    .itego-faq {
        &__title {
            font-size: 20px;
        }
    }
}
</style>