<template>
    <section class="itego-faq">
        <div class="container">
            <div class="itego-faq__title">
                Знаем, что Вас волнует
            </div>
            <ItegoFAQitem v-for="item in data" :title="item.title" :text="item.text"/>
        </div>
    </section>
</template>

<script>
import ItegoFAQitem from './ItegoFAQitem.vue'

export default {
    name: 'ItegoFAQ',
    data() {
        return {
            data: [
                {
                    "title": "В каких городах России вы работаете?",
                    "text": "В Москве и ближайших городах Московской области."
                },
                {
                    "title": "От чего зависит цена на IT-обслуживание?",
                    "text": "От количества ПК, серверов, а также сервисов, которые мы будем поддерживать."
                },
                {
                    "title": "Как быстро вы реагируете на инциденты и проблемы?",
                    "text": "Первая реакция на инцидент — не позже 20 минут, а чаще в течение 2–5 минут."
                },
                {
                    "title": "Как вы обеспечиваете сохранность моих данных и доступ к ним?",
                    "text": "Мы используем собственную систему хранения всех паролей с шифрованием, разграничиваем доступ для своих сотрудников. Вы также получаете доступ и всегда видите актуальные пароли в одном месте."
                },
                {
                    "title": "Как происходит масштабирование услуг при расширении бизнеса?",
                    "text": "Мы всегда на связи и стараемся всячески помогать вам. Поэтому при резком росте бизнеса вы не потеряете в качестве, так как мы следим за загруженностью сотрудников и вовремя пополняем штат или перераспределяем персонал на необходимые проекты."
                },
                {
                    "title": "Сколько человек будет поддерживать нашу компанию? Или это будет выделенный специалист?",
                    "text": "Наша структура делится на несколько линий с регламентами и инструкциями. Даже если вашу заявку примет новый сотрудник, он уже знает всё необходимое о вашей организации для решения задачи. Если вам нужен Project Manager или постоянный специалист, мы предоставим такую возможность."
                },
                {
                    "title": "Вы работаете только удалённо?",
                    "text": "Мы используем лицензированные решения для удалённого подключения к ПК. Если проблему невозможно решить дистанционно или запланированы работы в офисе, наши специалисты выезжают к клиентам без ограничений."
                },
                {
                    "title": "Вы работаете из дома или вы официальная организация?",
                    "text": "У нас есть офис, в котором работают сотрудники и основная команда для быстрого решения инцидентов. Вы можете посетить его и познакомиться со своей службой поддержки :)."
                },
            ]
        }
    },
    components: {
        ItegoFAQitem
    }
}
</script>

<style lang="scss">
.itego-faq {
    padding: 65px 0;
    &__title {
        font-family: "Montserrat", sans-serif;
        font-weight: 700;
        font-size: 45px;
        color: #1565C0;
        padding-bottom: 50px;
        border-bottom: 2px solid #1565C0;
    }
}
</style>

<style lang="scss">
@media screen and (max-width: 768px) {
    .itego-faq {
        &__title {
            font-size: 30px;
        }
    }
}
@media screen and (max-width: 425px) {
    .itego-faq {
        &__title {
            font-size: 20px;
        }
    }
}
</style>